In [2]:
import pandas as pd
import numpy as np

In [7]:
df = pd.read_csv('../data/uscities.csv')

In [8]:
df.shape

(28338, 17)

In [9]:
df.head(3)

,city,city_ascii,state_id,state_name,county_fips,county_name,lat,lng,population,density,source,military,incorporated,timezone,ranking,zips,id
0,New York,New York,NY,New York,36061,New York,40.6943,-73.9249,18713220,10715,polygon,False,True,America/New_York,1,11229 11226 11225 11224 11222 11221 11220 1138...,1840034016
1,Los Angeles,Los Angeles,CA,California,6037,Los Angeles,34.1139,-118.4068,12750807,3276,polygon,False,True,America/Los_Angeles,1,90291 90293 90292 91316 91311 90037 90031 9000...,1840020491
2,Chicago,Chicago,IL,Illinois,17031,Cook,41.8373,-87.6862,8604203,4574,polygon,False,True,America/Chicago,1,60018 60649 60641 60640 60643 60642 60645 6064...,1840000494

In [10]:
random_df = df[['city', 'state_name']].copy()

In [11]:
random_df.rename({'state_name':'state'}, axis=1, inplace=True)

In [12]:
random_df.head(3)

          city       state
0     New York    New York
1  Los Angeles  California
2      Chicago    Illinois

In [13]:
random_df['state'].nunique()

52

In [14]:
duplicate = random_df[random_df.duplicated()]
  
print("Duplicate Rows :")
  
# Print the resultant Dataframe
duplicate

Duplicate Rows :

              city         state
4553      Woodbury      New York
5301    Middletown  Pennsylvania
8018       Oakwood          Ohio
8908        Midway       Florida
11916  San Antonio   Puerto Rico
12023       Midway       Florida
12633      Oakland  Pennsylvania
12648  San Antonio   Puerto Rico
13691   Georgetown  Pennsylvania
15813  Chula Vista         Texas
17912      Oakwood          Ohio
18157      Oakland  Pennsylvania
21873     Franklin  Pennsylvania
22175  Chula Vista         Texas
22614    Jefferson  Pennsylvania
22935      Newtown  Pennsylvania
22963      Liberty  Pennsylvania
24586   Georgetown  Pennsylvania

In [15]:
random_df.drop_duplicates(keep=False, inplace=True)

In [16]:
random_df.shape

(28308, 2)

In [17]:
random_df.to_csv('random_input.csv', index=True)